Revit 2024 API
UnauthenticatedException Class
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
[SerializableAttribute]
public class UnauthenticatedException : ApplicationException
Visual Basic
<SerializableAttribute> _
Public Class UnauthenticatedException _
	Inherits ApplicationException
Visual C++
[SerializableAttribute]
public ref class UnauthenticatedException : public ApplicationException
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.UnauthenticatedException
See Also
UnauthenticatedException Members
Autodesk.Revit.Exceptions Namespace